secure-web-dev-syllabus.tex
% Created 2024-05-05 dom 18:30
% Intended LaTeX compiler: lualatex
\documentclass{scrartcl}
\usepackage[margin=2cm,includefoot,footskip=30pt]{geometry}\usepackage{layout}\usepackage{mathtools}
\usepackage{fvextra}
\usepackage{fancyvrb}
\usepackage{amsmath}
\usepackage[dvipsnames,table]{xcolor}
\usepackage{listings}
\usepackage{fixltx2e}
\usepackage{fontspec}
\defaultfontfeatures{Ligatures=TeX,Scale=MatchLowercase}
\setmainfont[SmallCapsFont={Linux Libertine Capitals}]{Linux Libertine O}
\setsansfont[SmallCapsFont={Linux Biolinum Capitals}]{Linux Biolinum O}
\setmonofont{Source Code Pro}
\DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\small,formatcom={\color[rgb]{0.5,0,0}},breaklines=true}
\input{/home/jefferson/Sync/tex/custom-listings}

\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{fvextra}
\fvset{breakbefore=(}
\usepackage{syntax}
\setsansfont{DejaVu Sans}
\setmonofont[Scale=MatchLowercase]{DejaVu Sans Mono}
\author{Prof. Dr. Jefferson O. Andrade}
\date{2024/1}
\title{Desenvolvimento Web Seguro\\\medskip
\large Plano de Ensino}
\hypersetup{
 pdfauthor={Prof. Dr. Jefferson O. Andrade},
 pdftitle={Desenvolvimento Web Seguro},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.2 (Org mode 9.6.15)}, 
 pdflang={English}}
\usepackage[style=abnt]{biblatex}
\addbibresource{/home/jefferson/Library/my-library-biblatex.bib}
\begin{document}

\maketitle

\section{Descrição do Curso:}
\label{sec:orgd3749b8}
O curso de Desenvolvimento Web Seguro visa fornecer aos alunos uma compreensão
abrangente das práticas e técnicas necessárias para desenvolver aplicativos web
seguros. Os alunos aprenderão sobre as ameaças mais comuns enfrentadas pelos
aplicativos web, bem como as melhores práticas para mitigar essas ameaças. O
curso incluirá uma combinação de pré-leituras, atividades práticas e discussões
em tempo real durante as aulas síncronas.

\section{Objetivos:}
\label{sec:org4826256}
\begin{itemize}
\item Compreender os princípios fundamentais da segurança de aplicativos web.
\item Identificar e mitigar vulnerabilidades comuns em aplicativos web, como XSS, CSRF e injeção de SQL.
\item Implementar práticas de autenticação e autorização seguras.
\item Configurar e manter comunicações seguras entre clientes e servidores.
\item Desenvolver e implementar uma mentalidade defensiva ao escrever código para aplicativos web.
\end{itemize}

\section{Estrutura do Curso:}
\label{sec:orgc859610}

\subsection{Semana 1: Introdução à Segurança de Desenvolvimento Web}
\label{sec:org8110ba5}
\begin{itemize}
\item Pré-aula: Leitura de material sobre segurança de aplicativos web
\item Aula Síncrona: Discussão sobre as ameaças e vulnerabilidades mais comuns
\end{itemize}

\subsection{Semana 2: Autenticação e Autorização}
\label{sec:org011ad94}
\begin{itemize}
\item Pré-aula: Assista a vídeos sobre métodos de autenticação e autorização
\item Aula Síncrona: Resolução de problemas e estudos de caso sobre autenticação e autorização
\end{itemize}

\subsection{Semana 3: Cross-Site Scripting (XSS) e Cross-Site Request Forgery (CSRF)}
\label{sec:org63730c4}
\begin{itemize}
\item Pré-aula: Estudo de casos de XSS e CSRF
\item Aula Síncrona: Discussão e prática de prevenção de XSS e CSRF
\end{itemize}

\subsection{Semana 4: Injeção de SQL e Gerenciamento de Sessão Segura}
\label{sec:org55fe843}
\begin{itemize}
\item Pré-aula: Exercícios de injeção de SQL e práticas de gerenciamento de sessão
\item Aula Síncrona: Revisão dos exercícios e discussão de boas práticas
\end{itemize}

\subsection{Semana 5: Comunicação Segura (SSL/TLS)}
\label{sec:org6881048}
\begin{itemize}
\item Pré-aula: Material sobre SSL/TLS e HTTPS
\item Aula Síncrona: Demonstração de configuração de SSL/TLS e discussão de melhores práticas
\end{itemize}

\subsection{Semana 6: Headers de Segurança e Política de Segurança de Conteúdo (CSP)}
\label{sec:orgdeca7fe}
\begin{itemize}
\item Pré-aula: Leitura sobre headers de segurança e CSP
\item Aula Síncrona: Implementação e configuração prática de CSP
\end{itemize}

\subsection{Semana 7: Upload e Download de Arquivos Seguros}
\label{sec:orgff9026c}
\begin{itemize}
\item Pré-aula: Tutoriais sobre segurança de upload e download de arquivos
\item Aula Síncrona: Discussão e prática de técnicas de segurança
\end{itemize}

\subsection{Semana 8: Práticas de Codificação Segura}
\label{sec:org267189c}
\begin{itemize}
\item Pré-aula: Revisão de código e identificação de vulnerabilidades
\item Aula Síncrona: Revisão dos conceitos e feedback sobre projetos individuais
\end{itemize}

\section{Avaliação:}
\label{sec:orgf31b8cc}
\begin{itemize}
\item Participação nas discussões e atividades síncronas: 30\%
\item Tarefas práticas e projetos individuais: 50\%
\item Exame final online: 20\%
\end{itemize}

\section{Bibliografia:}
\label{sec:org322103f}

\nocite{owasp.top10.2021,li2021,yaworski2019,ball2022,hoffman2020,seitz2021,stuttard2011,hope2008}

\printbibliography[heading=subbibliography,title=Bibliografia Básica,keyword=secure-web-dev:2024:bib:main]

\printbibliography[heading=subbibliography,title=Bibliografia Complementar,keyword=secure-web-dev:2024:bib:aux]


\section{Observação:}
\label{sec:org7feefe7}
Este plano de ensino está sujeito a ajustes conforme necessário para atender às
necessidades dos alunos e garantir uma experiência de aprendizado eficaz em um
ambiente de sala de aula invertida.
\end{document}
